{"data":{"markdownRemark":{"html":"<p>High-throughput frameworks discover new materials by decorating structure prototypes with different atomic species. These structure prototypes act as blue-prints for a material and are curated from a number of different sources such as the Pauling file and Inorganic Crystal Structure Database (ICSD).</p>\n<p><img src=\"images/proto-lib-main.png\"></p>\n<p>The AFLOW library of crystallographic prototypes serves as another source of structure prototypes for the materials science community. These prototypes where curated by Michael Mehl in collaboration with the AFLOW team. In this project I worked on the the website version of the prototype library. This site allows users the option to search, visualize and tweak the parameters of any structure within our library. </p>\n<p>From the main page users can search for a structure by common name of composition. Additionally they can search for structures by a number of catagories such as space group and Pearson symbol. Traveling to any of these pages with display a list of structures as a series of cards. </p>\n<p>Clicking on a card will open the corresponding structures entry page. This page contains a interactive visualization of the structure (using JMol) and all the relevant information. This information includes the Prototype, Pearson symbol, space group number and symbol as well as all the equations for the basis vectors. </p>\n<p>Most importantly is the option to generate a custom prototype. Using the form on the bottom of the page users can input their own parameters and return their custom prototype in any of the 4 popular structure file formats. Upon entry, the JMol visualization will update to reflect the changes made to the parameters of the prototype.</p>","frontmatter":{"date":"June 26, 2018","path":"/library-of-crystallographic-prototypes","title":"Library of Crystallographic Prototypes","image":{"childImageSharp":{"sizes":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAQCAYAAAAWGF8bAAAACXBIWXMAAAsSAAALEgHS3X78AAACUElEQVQ4y6WU/UtTYRTH/f+CyiItGJSElfhL/SjRwFmOTSmsTMG0ILBC57SlG5tIpPOluc25l6uWuum23Nz77u6cuvvpIjjEkC068OWBcx4+fM85D08d50KWZf4lzt+vO1s4LTo2ljEuGTF7zFhWLNi8Nqyr1oom3ZNYPBakkvQXtAIsy+WTMyNmaOi8SX3XNVRvVNzuu0PbpzbUI2o0Yxpa37XS2NNAU38T8Wy8OjCeidOovYXqpYqWoQcnEI1Bg3ZCi96kR/tFq+RbaB5oJplPVgcmsgludDZyr/8+vZbX9Fn7GZwZZGhmiOG5Yd5Pv6XX/IoOQ0dtDpO5JFc09bR/1sAxFLMZirkcYi6PKEmkomGkcJjFnw4iyXCNwI5rqD885qhQYNmxin/ZQy6fIxXaJh4Osr+zxbelSaKZ37UBryrAJwrwOLGPaWYBi2mMbCxGOrZHai9KqVDiu9NKJB2t0WF7PU+VGbk9W0xPmJi1L/B13ExWcZnJpCmJErOBOSKpSK0tX+fZsBqfb1NpzcmK/QeLgQ2yu7tIooh8IDMvLNQOvKws5dHgQzZ31/AHfXh9doSgF++2F9cvF2shgZH50dqAMeUdNj2/S/tHDV3GbnSjOnRjXegMevQGHXrjC3TjPXQrtbSYrg4MxoLYHDY4BClfoKjMqyJlGcVEiGLEzYFYoFyWLwaeJvNSnqlFM86AE5fgVuQ6kVtw4lgXiNm1yFOXWA0scXB4dDHwbCGVT+EP+RF21hQJFfl21kmsG5EDA2wE3ZSOy9Ud/u/39QewioQzpYzI1QAAAABJRU5ErkJggg==","aspectRatio":1.24,"src":"/static/encyclopedia-933e425452ed6c387d16ee91c3b7e264-ac8ec.png","srcSet":"/static/encyclopedia-933e425452ed6c387d16ee91c3b7e264-4686a.png 158w,\n/static/encyclopedia-933e425452ed6c387d16ee91c3b7e264-9560e.png 315w,\n/static/encyclopedia-933e425452ed6c387d16ee91c3b7e264-ac8ec.png 620w","sizes":"(max-width: 620px) 100vw, 620px"}}}}}},"pageContext":{}}